a = 1 #javascript 와 달리 python 에는 let 같은 설정어가 없음. 즉, 관계없이 사용.

가격 = 10000 # 위와 같은 논리에 의해, 이런 식으로 데이터 값을 붙임.
부가세율 = 0.1
결과 = 가격 * 부가세율
print(결과)

print('안녕하세요, 우타하님, .... 우타하 ... 안녕히 계세요. 우타하님') # 매일 이메일을 보낸다고 가정할 때, 내용은 모두가 동일하게 매일 바뀌지만, 이름은 각각 다른 이름(혹은 주소)을 넣어야되는 경우.
print('안녕하세요, 베르단디님, .... 우타하 ... 안녕히 계세요. 베르단디님') #'....우타하...'-> 항상 들어가야하는 텍스트. / 이런 경우 변수를 쓰면 편리함.

name = '이고잉' # 변수 처리한 것.
print('안녕하세요, '+name+'님, .... 이고잉 ... 안녕히 계세요. '+name+'님')
name = '이고잉' # '+~+' 방식과 같은 기능.(최신)
print(f'안녕하세요, {name}님, .... 이고잉 ... 안녕히 계세요. {name}님') #f string문법(최근에 도입)

